In [2]:
import pandas as pd
from sklearn.impute import SimpleImputer
from sklearn.model_selection import train_test_split

In [3]:
df = pd.read_excel(r"C:\Users\Dell\Downloads\datasets\Salary_Data.xlsx")
df.head()

    Age  Gender  ... Years of Experience    Salary
0  32.0    Male  ...                 5.0   90000.0
1  28.0  Female  ...                 3.0   65000.0
2  45.0    Male  ...                15.0  150000.0
3  36.0  Female  ...                 7.0   60000.0
4  52.0    Male  ...                20.0  200000.0

[5 rows x 6 columns]

In [4]:
columns_to_drop=['Gender','Education Level','Job Title']
df=df.drop(columns=columns_to_drop)
df.head()

    Age  Years of Experience    Salary
0  32.0                  5.0   90000.0
1  28.0                  3.0   65000.0
2  45.0                 15.0  150000.0
3  36.0                  7.0   60000.0
4  52.0                 20.0  200000.0

In [5]:
df.isnull().sum()

Age                    2
Years of Experience    2
Salary                 2
dtype: int64

Train test split

In [12]:
x_train,x_test,y_train,y_test=train_test_split(df.drop(columns=['Salary']),df['Salary'],test_size=0.2,random_state=42)

Dealing with nan values

In [16]:
imputer = SimpleImputer(strategy='median')